atlas0fd00m/rfcat/firmware/include/cc2530-ext.h
/*
#ifdef CC2531
 SFRX(OPAMPMC     , 0x61A6)
#elif defined CC2533
 SFRX(MONMUX      , 0x61A6)
#elif defined CC2541
 SFRX(OPAMPMC     , 0x61AD)
#endif

#define T3CC1   0xEA
#define T4CTL   0xEB
#define T4CCTL0 0xEC
#define T4CC0   0xED
#define T4CCTL1 0xEE
#define T4CC1   0xEF
#define TIMIF   0xD8
#define U0CSR   0x86
#define U0DBUF  0xC1
#define U0BAUD  0xC2
#define U0UCR   0xC4
#define U0GCR   0xC5
#define U1CSR   0xF8
#define U1DBUF  0xF9
#define U1BAUD  0xFA
#define U1UCR   0xFB
#define U1GCR   0xFC
#define WDCTL   0xCF
#define T4CNT   0xC9
*/


// 0x6200–0x622B —
/*
#include<compiler.h>
SFRX(I2CCFG      , 0x6230)
SFRX(I2CSTAT     , 0x6231)
SFRX(I2CDATA     , 0x6232)
SFRX(I2CADDR     , 0x6233)
SFRX(I2CWC       , 0x6234)
SFRX(I2CIO       , 0x6235)
SFRX(OBSSEL0     , 0x6243)
SFRX(OBSSEL1     , 0x6244)
SFRX(OBSSEL2     , 0x6245)
SFRX(OBSSEL3     , 0x6246)
SFRX(OBSSEL4     , 0x6247)
SFRX(OBSSEL5     , 0x6248)
SFRX(CHVER       , 0x6249)
SFRX(CHIPID      , 0x624A)
SFRX(TR0         , 0x624B)
SFRX(DBGDATA     , 0x6260)
SFRX(SRCRC       , 0x6262)
SFRX(BATTMON     , 0x6264)
SFRX(IVCTRL      , 0x6265)
SFRX(FCTL        , 0x6270)
SFRX(FADDRL      , 0x6271)
SFRX(FADDRH      , 0x6272)
SFRX(FWDATA      , 0x6273)
SFRX(CHIPINFO0   , 0x6276)
SFRX(CHIPINFO1   , 0x6277)
SFRX(IRCTL       , 0x6281)
SFRX(CLD         , 0x6290)
SFRX(T1CCTL0     , 0x62A0)
SFRX(T1CCTL1     , 0x62A1)
SFRX(T1CCTL2     , 0x62A2)
SFRX(T1CCTL3     , 0x62A3)
SFRX(T1CCTL4     , 0x62A4)
SFRX(T1CC0L      , 0x62A6)
SFRX(T1CC0H      , 0x62A7)


SFRX(T1CC1L      , 0x62A8)
SFRX(T1CC1H      , 0x62A9)
SFRX(T1CC2L      , 0x62AA)
SFRX(T1CC2H      , 0x62AB)
SFRX(T1CC3L      , 0x62AC)
SFRX(T1CC3H      , 0x62AD)
SFRX(T1CC4L      , 0x62AE)
SFRX(T1CC4H      , 0x62AF)
SFRX(STCC        , 0x62B0)
SFRX(STCS        , 0x62B1)
SFRX(STCV0       , 0x62B2)
SFRX(STCV1       , 0x62B3)
SFRX(STCV2       , 0x62B4)
SFRX(OPAMPC      , 0x62C0)
SFRX(OPAMPS      , 0x62C1)
SFRX(CMPCTL      , 0x62D0)
*/
#include <cc2530.h>
#endif
